#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_caller_identity.current: Reading...
module.vpc.data.aws_caller_identity.current: Reading...
module.vpc.data.aws_availability_zones.available: Reading...
module.vpc.data.aws_iam_policy_document.assume_role: Reading...
module.vpc.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=2717921857]
data.aws_caller_identity.current: Read complete after 0s [id=743794601996]
module.vpc.data.aws_caller_identity.current: Read complete after 0s [id=743794601996]
module.vpc.data.aws_availability_zones.available: Read complete after 0s [id=us-east-2]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # aws_elasticache_serverless_cache.serverless_cache will be created
  + resource "aws_elasticache_serverless_cache" "serverless_cache" {
      + arn                      = (known after apply)
      + create_time              = (known after apply)
      + daily_snapshot_time      = "09:00"
      + description              = "Redis cache server for app-9"
      + endpoint                 = (known after apply)
      + engine                   = "redis"
      + full_engine_version      = (known after apply)
      + id                       = (known after apply)
      + kms_key_id               = (known after apply)
      + major_engine_version     = "7"
      + name                     = "app-9"
      + reader_endpoint          = (known after apply)
      + security_group_ids       = [
          + (known after apply),
        ]
      + snapshot_retention_limit = 1
      + status                   = (known after apply)
      + subnet_ids               = [
          + (known after apply),
          + (known after apply),
        ]
      + tags_all                 = {
          + "Source" = "https://github.com/kunduso/amazon-elasticache-serverless"
        }

      + cache_usage_limits {
          + data_storage {
              + maximum = 10
              + unit    = "GB"
            }
          + ecpu_per_second {
              + maximum = 5000
            }
        }
    }

  # aws_kms_alias.key will be created
  + resource "aws_kms_alias" "key" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/app-9"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # aws_kms_key.custom_kms_key will be created
  + resource "aws_kms_key" "custom_kms_key" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days            = 7
      + description                        = "KMS key for app-9"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = (known after apply)
      + rotation_period_in_days            = (known after apply)
      + tags_all                           = {
          + "Source" = "https://github.com/kunduso/amazon-elasticache-serverless"
        }
    }

  # aws_kms_key_policy.encrypt_app will be created
  + resource "aws_kms_key_policy" "encrypt_app" {
      + bypass_policy_lockout_safety_check = false
      + id                                 = (known after apply)
      + key_id                             = (known after apply)
      + policy                             = jsonencode(
            {
              + Id        = "encryption-rest"
              + Statement = [
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::743794601996:root"
                        }
                      + Resource  = "*"
                      + Sid       = "Enable IAM User Permissions"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # aws_security_group.custom_sg will be created
  + resource "aws_security_group" "custom_sg" {
      + arn                    = (known after apply)
      + description            = "manage traffic for app-9"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "app-9_allow_inbound_access"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "app-9-sg"
        }
      + tags_all               = {
          + "Name"   = "app-9-sg"
          + "Source" = "https://github.com/kunduso/amazon-elasticache-serverless"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group_rule.egress_custom_sg will be created
  + resource "aws_security_group_rule" "egress_custom_sg" {
      + cidr_blocks              = [
          + "12.25.15.0/25",
        ]
      + description              = "allow traffic to reach outside the vpc"
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # aws_security_group_rule.ingress_custom_sg will be created
  + resource "aws_security_group_rule" "ingress_custom_sg" {
      + cidr_blocks              = [
          + "12.25.15.0/25",
        ]
      + description              = "allow traffic to the cache cluster"
      + from_port                = 6379
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 6379
      + type                     = "ingress"
    }

  # module.vpc.data.aws_iam_policy_document.vpc_flow_log_policy_document[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "vpc_flow_log_policy_document" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:DescribeLogGroups",
              + "logs:DescribeLogStreams",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.vpc.aws_cloudwatch_log_group.network_flow_logging[0] will be created
  + resource "aws_cloudwatch_log_group" "network_flow_logging" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + kms_key_id        = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "app-9-flow-logs"
      + name_prefix       = (known after apply)
      + retention_in_days = 365
      + skip_destroy      = false
      + tags              = {
          + "Name"   = "app-9-flow-logs"
          + "Source" = "https://github.com/kunduso/terraform-aws-vpc"
        }
      + tags_all          = {
          + "Name"   = "app-9-flow-logs"
          + "Source" = "https://github.com/kunduso/terraform-aws-vpc"
        }
    }

  # module.vpc.aws_default_security_group.default will be created
  + resource "aws_default_security_group" "default" {
      + arn                    = (known after apply)
      + description            = (known after apply)
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"   = "app-9-default"
          + "Source" = "https://github.com/kunduso/terraform-aws-vpc"
        }
      + tags_all               = {
          + "Name"   = "app-9-default"
          + "Source" = "https://github.com/kunduso/terraform-aws-vpc"
        }
      + vpc_id                 = (known after apply)
    }

  # module.vpc.aws_flow_log.network_flow_logging[0] will be created
  + resource "aws_flow_log" "network_flow_logging" {
      + arn                      = (known after apply)
      + iam_role_arn             = (known after apply)
      + id                       = (known after apply)
      + log_destination          = (known after apply)
      + log_destination_type     = "cloud-watch-logs"
      + log_format               = (known after apply)
      + log_group_name           = (known after apply)
      + max_aggregation_interval = 600
      + tags                     = {
          + "Name"   = "app-9-flow-logs"
          + "Source" = "https://github.com/kunduso/terraform-aws-vpc"
        }
      + tags_all                 = {
          + "Name"   = "app-9-flow-logs"
          + "Source" = "https://github.com/kunduso/terraform-aws-vpc"
        }
      + traffic_type             = "ALL"
      + vpc_id                   = (known after apply)
    }

  # module.vpc.aws_iam_role.vpc_flow_log_role[0] will be created
  + resource "aws_iam_role" "vpc_flow_log_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "vpc-flow-logs.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "app-9-vpc-flow-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name"   = "app-9-vpc-flow-role"
          + "Source" = "https://github.com/kunduso/terraform-aws-vpc"
        }
      + tags_all              = {
          + "Name"   = "app-9-vpc-flow-role"
          + "Source" = "https://github.com/kunduso/terraform-aws-vpc"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.vpc.aws_iam_role_policy.vpc_flow_log_role_policy[0] will be created
  + resource "aws_iam_role_policy" "vpc_flow_log_role_policy" {
      + id          = (known after apply)
      + name        = "app-9-vpc-flow-policy"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # module.vpc.aws_kms_alias.key[0] will be created
  + resource "aws_kms_alias" "key" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/app-9-encrypt-flow-log"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # module.vpc.aws_kms_key.custom_kms_key[0] will be created
  + resource "aws_kms_key" "custom_kms_key" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days            = 7
      + description                        = "KMS key for app-9"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = (known after apply)
      + rotation_period_in_days            = (known after apply)
      + tags                               = {
          + "Name"   = "app-9-encryption-key"
          + "Source" = "https://github.com/kunduso/terraform-aws-vpc"
        }
      + tags_all                           = {
          + "Name"   = "app-9-encryption-key"
          + "Source" = "https://github.com/kunduso/terraform-aws-vpc"
        }
    }

  # module.vpc.aws_kms_key_policy.encrypt_log[0] will be created
  + resource "aws_kms_key_policy" "encrypt_log" {
      + bypass_policy_lockout_safety_check = false
      + id                                 = (known after apply)
      + key_id                             = (known after apply)
      + policy                             = jsonencode(
            {
              + Id        = "app-9-flow-log-encryption"
              + Statement = [
                  + {
                      + Action    = [
                          + "kms:*",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::743794601996:root"
                        }
                      + Resource  = "*"
                      + Sid       = "Enable IAM User Permissions"
                    },
                  + {
                      + Action    = [
                          + "kms:Encrypt",
                          + "kms:Decrypt",
                          + "kms:ReEncryptFrom",
                          + "kms:ReEncryptTo",
                          + "kms:GenerateDataKey",
                          + "kms:DescribeKey",
                        ]
                      + Condition = {
                          + ArnEquals = {
                              + "kms:EncryptionContext:aws:logs:arn" = [
                                  + "arn:aws:logs:us-east-2:743794601996:log-group:app-9-flow-logs",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "logs.us-east-2.amazonaws.com"
                        }
                      + Resource  = "*"
                      + Sid       = "AllowCloudWatchLogsEncryption"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # module.vpc.aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"   = "app-9-private-1"
          + "Source" = "https://github.com/kunduso/terraform-aws-vpc"
        }
      + tags_all         = {
          + "Name"   = "app-9-private-1"
          + "Source" = "https://github.com/kunduso/terraform-aws-vpc"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.private[1] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"   = "app-9-private-2"
          + "Source" = "https://github.com/kunduso/terraform-aws-vpc"
        }
      + tags_all         = {
          + "Name"   = "app-9-private-2"
          + "Source" = "https://github.com/kunduso/terraform-aws-vpc"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.public[0] will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"   = "app-9-public"
          + "Source" = "https://github.com/kunduso/terraform-aws-vpc"
        }
      + tags_all         = {
          + "Name"   = "app-9-public"
          + "Source" = "https://github.com/kunduso/terraform-aws-vpc"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "12.25.15.64/27"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"   = "app-9-private-1"
          + "Source" = "https://github.com/kunduso/terraform-aws-vpc"
        }
      + tags_all                                       = {
          + "Name"   = "app-9-private-1"
          + "Source" = "https://github.com/kunduso/terraform-aws-vpc"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "12.25.15.96/27"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"   = "app-9-private-2"
          + "Source" = "https://github.com/kunduso/terraform-aws-vpc"
        }
      + tags_all                                       = {
          + "Name"   = "app-9-private-2"
          + "Source" = "https://github.com/kunduso/terraform-aws-vpc"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "12.25.15.0/27"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"   = "app-9-public-1"
          + "Source" = "https://github.com/kunduso/terraform-aws-vpc"
        }
      + tags_all                                       = {
          + "Name"   = "app-9-public-1"
          + "Source" = "https://github.com/kunduso/terraform-aws-vpc"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "12.25.15.32/27"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"   = "app-9-public-2"
          + "Source" = "https://github.com/kunduso/terraform-aws-vpc"
        }
      + tags_all                                       = {
          + "Name"   = "app-9-public-2"
          + "Source" = "https://github.com/kunduso/terraform-aws-vpc"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_vpc.this will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + cidr_block                           = "12.25.15.0/25"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name"   = "app-9"
          + "Source" = "https://github.com/kunduso/terraform-aws-vpc"
        }
      + tags_all                             = {
          + "Name"   = "app-9"
          + "Source" = "https://github.com/kunduso/terraform-aws-vpc"
        }
    }

Plan: 27 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: TFplan.JSON

To perform exactly these actions, run the following command to apply:
    terraform apply "TFplan.JSON"

```

</details>

*Pushed by: @kunduso, Action: `pull_request`*